import Vue from 'vue'
import Vuex from 'vuex'

Vue.use(Vuex);

export default new Vuex.Store({
    state: {
        videoParams: JSON.parse(sessionStorage.getItem('videoParams')) || {},

        objectInfo:{},
        // 导航栏列表
        navList: [
            {
                id: 1,
                name: "home",
                title: "主站",
                svg: '<svg t="1587718475088" class="icon" viewBox="0 0 1024 1024" version="1.1" xmlns="http://www.w3.org/2000/svg" p-id="1861" width="40" height="30"><path d="M786.92 732.7l-107.48-44.21 38.44-76.76 99.78 59.56z" fill="#02C3F7" p-id="1862"></path><path d="M717.88 611.73l99.78 59.57-30.75 61.41-107.47-44.21 38.44-76.77m-17.84-61.09l-20.88 41.7-38.44 76.76-20.88 41.7 43.13 17.74 107.47 44.21 37.19 15.3 18.01-35.96 30.75-61.41 18.01-35.96-34.53-20.62-99.78-59.57-40.05-23.89z" fill="#2F57B2" p-id="1863"></path><path d="M839.9 720.44m-55.03 0a55.03 55.03 0 1 0 110.06 0 55.03 55.03 0 1 0-110.06 0Z" fill="#FFFFFF" p-id="1864"></path><path d="M839.94 665.4c8.28 0 16.69 1.88 24.6 5.84 27.18 13.61 38.17 46.67 24.57 73.84-9.65 19.27-29.07 30.4-49.25 30.4-8.28 0-16.69-1.88-24.6-5.84-27.18-13.61-38.17-46.67-24.57-73.84 9.65-19.26 29.08-30.4 49.25-30.4m0-43.31c-37.49 0-71.2 20.82-87.97 54.32-11.76 23.49-13.67 50.15-5.38 75.07 8.29 24.92 25.79 45.13 49.28 56.89 13.61 6.82 28.82 10.42 43.99 10.42 37.49 0 71.2-20.81 87.97-54.32 11.76-23.49 13.67-50.15 5.38-75.07-8.29-24.92-25.79-45.13-49.28-56.89-13.61-6.81-28.82-10.42-43.99-10.42z" fill="#2F57B2" p-id="1865"></path><path d="M205.33 623.75l93.06 69.6 46.2-72.35-102.3-55.13z" fill="#02C3F7" p-id="1866"></path><path d="M242.29 565.87L344.59 621l-46.2 72.36-93.06-69.6 36.96-57.89m-14.86-57.21l-21.64 33.9-36.96 57.88-21.64 33.9 32.21 24.09 93.06 69.6 37.35 27.93 25.1-39.31 46.2-72.36 25.1-39.31-41.05-22.12-102.3-55.13-35.43-19.07z" fill="#2F57B2" p-id="1867"></path><path d="M186.49 572.85m-56.94 0a56.94 56.94 0 1 0 113.88 0 56.94 56.94 0 1 0-113.88 0Z" fill="#FFFFFF" p-id="1868"></path><path d="M186.54 515.9c10.49 0 21.1 2.89 30.59 8.96 26.51 16.92 34.27 52.13 17.35 78.64-10.86 17.01-29.26 26.31-48.05 26.31-10.49 0-21.1-2.89-30.59-8.96-26.51-16.92-34.27-52.13-17.35-78.64 10.87-17.01 29.26-26.31 48.05-26.31m0-43.3c-34.43 0-66.04 17.31-84.55 46.31-14.41 22.57-19.17 49.4-13.4 75.55 5.77 26.15 21.38 48.49 43.95 62.9 16.15 10.31 34.79 15.76 53.9 15.76 34.43 0 66.04-17.31 84.55-46.31 29.75-46.59 16.04-108.7-30.55-138.45-16.15-10.31-34.79-15.76-53.9-15.76z" fill="#2F57B2" p-id="1869"></path><path d="M715.49 661.11c0-51.13-49.99-92.58-111.66-92.58H403.36c-61.67 0-111.66 41.45-111.66 92.58v66.11c0 8 17.25 135.55 17.25 135.55h172.47l7.39-47.38h28.34l7.39 47.38h172.47s18.48-127.48 18.48-135.55v-66.11z" fill="#02C3F7" p-id="1870"></path><path d="M715.75 884.42H506l-3.02-19.37-3.02 19.37H290.02l-2.54-18.76c-6.51-48.18-17.44-130.23-17.44-138.45V661.1c0-62.99 59.81-114.24 133.32-114.24h200.47c73.51 0 133.32 51.25 133.32 114.24v66.11c0 7.96-10.17 79.8-18.7 138.66l-2.7 18.55z m-172.68-43.31h135.18c7.63-53.07 15.07-106.75 15.58-114.29v-65.71c0-39.11-40.38-70.93-90.01-70.93H403.36c-49.63 0-90.01 31.82-90.01 70.93v65.76c0.49 7.99 8.33 68.02 14.53 114.25h135l7.39-47.39h65.41l7.39 47.38z" fill="#2F57B2" p-id="1871"></path><path d="M521.77 934.4h177.99c6.25 0 11.31-5.06 11.31-11.31v-75.35c0-6.25-5.06-11.31-11.31-11.31H521.77c-6.25 0-11.31 5.06-11.31 11.31v75.35c0 6.24 5.07 11.31 11.31 11.31z" fill="#FFFFFF" p-id="1872"></path><path d="M662.09 956.05H559.45c-38.95 0-70.64-31.69-70.64-70.64s31.69-70.64 70.64-70.64h102.64c38.95 0 70.64 31.69 70.64 70.64s-31.69 70.64-70.64 70.64z m-102.64-97.97c-15.07 0-27.33 12.26-27.33 27.33 0 15.07 12.26 27.33 27.33 27.33h102.64c15.07 0 27.33-12.26 27.33-27.33 0-15.07-12.26-27.33-27.33-27.33H559.45z" fill="#2F57B2" p-id="1873"></path><path d="M489.82 934.4H311.83c-6.25 0-11.31-5.06-11.31-11.31v-75.35c0-6.25 5.06-11.31 11.31-11.31h177.99c6.25 0 11.31 5.06 11.31 11.31v75.35c0 6.24-5.06 11.31-11.31 11.31z" fill="#FFFFFF" p-id="1874"></path><path d="M452.15 956.05H349.51c-38.95 0-70.64-31.69-70.64-70.64s31.69-70.64 70.64-70.64h102.64c38.95 0 70.64 31.69 70.64 70.64s-31.69 70.64-70.64 70.64z m-102.64-97.97c-15.07 0-27.33 12.26-27.33 27.33 0 15.07 12.26 27.33 27.33 27.33h102.64c15.07 0 27.33-12.26 27.33-27.33 0-15.07-12.26-27.33-27.33-27.33H349.51z" fill="#2F57B2" p-id="1875"></path><path d="M212.67 389.2a295.08 280.32 0 1 0 590.16 0 295.08 280.32 0 1 0-590.16 0Z" fill="#02C3F7" p-id="1876"></path><path d="M271.69 420.35a236.06 202.46 0 1 0 472.12 0 236.06 202.46 0 1 0-472.12 0Z" fill="#FFFFFF" p-id="1877"></path><path d="M396.33 187.72c-4.91 0-9.61-2.8-11.8-7.55-3.01-6.52-0.16-14.23 6.35-17.24l1.19-0.55c7.06-3.26 14.35-6.64 24.98-10 6.83-2.17 14.14 1.62 16.31 8.46 2.17 6.84-1.62 14.14-8.46 16.31-9.06 2.87-15.31 5.76-21.93 8.82l-1.2 0.55c-1.77 0.81-3.62 1.2-5.44 1.2z" fill="#FFFFFF" p-id="1878"></path><path d="M364.244909 218.564459a75.22 66.76 81.73 1 0 132.131557-19.205258 75.22 66.76 81.73 1 0-132.131557 19.205258Z" fill="#FFFFFF" p-id="1879"></path><path d="M553.383724 282.79047a66.72 75.27 11.221 1 0 29.294163-147.662263 66.72 75.27 11.221 1 0-29.294163 147.662263Z" fill="#FFFFFF" p-id="1880"></path><path d="M438.645403 222.066231a20.07 18.52 80.514 1 0 36.533511-6.104436 20.07 18.52 80.514 1 0-36.533511 6.104436Z" fill="#3F3F3F" p-id="1881"></path><path d="M537.187697 238.616689a18.51 20.08 12.809 1 0 8.903539-39.1606 18.51 20.08 12.809 1 0-8.903539 39.1606Z" fill="#3F3F3F" p-id="1882"></path><path d="M465.54 281.67a34.58 32.47 0 1 0 69.16 0 34.58 32.47 0 1 0-69.16 0Z" fill="#F26871" p-id="1883"></path><path d="M477.24 286.76a6.5 6.5 0 0 1-6.5-6.5c0-5.19 1.85-10.16 5.34-14.4 2.28-2.77 6.38-3.16 9.15-0.87a6.493 6.493 0 0 1 0.87 9.15c-1.57 1.91-2.37 3.97-2.37 6.12 0.01 3.59-2.9 6.5-6.49 6.5zM495.65 268.44c-3.07 0-5.8-2.18-6.38-5.31a6.498 6.498 0 0 1 5.2-7.58l0.93-0.16c3.51-0.57 6.87 1.86 7.43 5.4a6.499 6.499 0 0 1-5.4 7.43l-0.58 0.1c-0.41 0.08-0.81 0.12-1.2 0.12z" fill="#FFFFFF" p-id="1884"></path><path d="M560.24 300.4l76.61-34.05" fill="#02C3F7" p-id="1885"></path><path d="M560.24 304.73a4.331 4.331 0 0 1-1.76-8.29l76.61-34.05c2.19-0.98 4.75 0.01 5.72 2.2 0.97 2.19-0.01 4.75-2.2 5.72L562 304.35c-0.57 0.26-1.17 0.38-1.76 0.38z" fill="#2F57B2" p-id="1886"></path><path d="M683.66 419.19c-5.55 71.68-68.11 145.22-174.92 147.2-114.48 2.13-176.99-75.72-184.7-147.2-6.39-59.21 363.88-54.96 359.62 0z" fill="#F26871" p-id="1887"></path><path d="M500.66 317.42v55.33" fill="#02C3F7" p-id="1888"></path><path d="M500.66 377.08c-2.39 0-4.33-1.94-4.33-4.33v-55.33c0-2.39 1.94-4.33 4.33-4.33s4.33 1.94 4.33 4.33v55.33c0 2.39-1.94 4.33-4.33 4.33z" fill="#2F57B2" p-id="1889"></path><path d="M683.66 291.88L564.5 317.42" fill="#02C3F7" p-id="1890"></path><path d="M564.49 321.75c-2 0-3.8-1.39-4.23-3.42a4.33 4.33 0 0 1 3.33-5.14l119.16-25.53c2.33-0.49 4.64 0.99 5.14 3.33a4.33 4.33 0 0 1-3.33 5.14L565.4 321.66c-0.3 0.06-0.61 0.09-0.91 0.09z" fill="#2F57B2" p-id="1891"></path><path d="M687.92 364.23L564.5 338.7" fill="#02C3F7" p-id="1892"></path><path d="M687.92 368.57c-0.29 0-0.59-0.03-0.88-0.09l-123.42-25.53c-2.34-0.49-3.85-2.78-3.36-5.12a4.326 4.326 0 0 1 5.12-3.36L688.8 360c2.34 0.49 3.85 2.78 3.36 5.12-0.42 2.04-2.23 3.45-4.24 3.45z" fill="#2F57B2" p-id="1893"></path><path d="M440 300.4l-76.61-34.05" fill="#02C3F7" p-id="1894"></path><path d="M440 304.73c-0.59 0-1.18-0.12-1.76-0.38l-76.61-34.05a4.34 4.34 0 0 1-2.2-5.72 4.331 4.331 0 0 1 5.72-2.2l76.61 34.05a4.34 4.34 0 0 1 2.2 5.72 4.33 4.33 0 0 1-3.96 2.58z" fill="#2F57B2" p-id="1895"></path><path d="M316.58 291.88l119.17 25.54" fill="#02C3F7" p-id="1896"></path><path d="M435.75 321.75c-0.3 0-0.6-0.03-0.91-0.1l-119.16-25.53a4.33 4.33 0 0 1-3.33-5.14c0.5-2.34 2.8-3.82 5.14-3.33l119.16 25.53c2.34 0.5 3.83 2.8 3.33 5.14a4.332 4.332 0 0 1-4.23 3.43z" fill="#2F57B2" p-id="1897"></path><path d="M312.32 364.23l123.43-25.53" fill="#02C3F7" p-id="1898"></path><path d="M312.32 368.57c-2.01 0-3.81-1.41-4.24-3.45a4.339 4.339 0 0 1 3.36-5.12l123.42-25.53a4.342 4.342 0 0 1 5.12 3.36 4.339 4.339 0 0 1-3.36 5.12L313.2 368.48c-0.3 0.06-0.59 0.09-0.88 0.09z" fill="#2F57B2" p-id="1899"></path><path d="M307.67 183.65c-6 0-11.96-2.48-16.25-7.33-7.91-8.97-7.06-22.65 1.91-30.56l1.24-1.08c9.04-7.82 22.72-6.84 30.54 2.2 7.83 9.04 6.84 22.72-2.2 30.54l-0.93 0.81c-4.1 3.63-9.22 5.42-14.31 5.42z" fill="#2F57B2" p-id="1900"></path><path d="M507.75 670c-174.65 0-316.73-135.47-316.73-301.98 0-61.79 19.44-121.19 56.21-171.8 7.03-9.67 20.58-11.81 30.25-4.79 9.67 7.03 11.82 20.57 4.79 30.25-31.36 43.15-47.94 93.76-47.94 146.34 0 142.63 122.66 258.67 273.42 258.67s273.42-116.04 273.42-258.67-122.65-258.66-273.42-258.66c-43.01 0-84.17 9.17-122.32 27.26-10.8 5.12-23.72 0.52-28.84-10.29-5.12-10.81-0.52-23.72 10.29-28.84 44-20.86 91.39-31.44 140.87-31.44 174.65 0 316.73 135.46 316.73 301.98S682.4 670 507.75 670z" fill="#2F57B2" p-id="1901"></path><path d="M375.08 699.44a124.61 79.5 0 1 0 249.22 0 124.61 79.5 0 1 0-249.22 0Z" fill="#FFFFFF" p-id="1902"></path><path d="M707.49 651.81H282.03c-4.42 0-7.99-3.58-7.99-7.99v-53.26c0-4.42 3.58-7.99 7.99-7.99h425.46c4.42 0 7.99 3.58 7.99 7.99v53.26c0.01 4.42-3.57 7.99-7.99 7.99z" fill="#F26871" p-id="1903"></path><path d="M507.96 628.48m-54.81 0a54.81 54.81 0 1 0 109.62 0 54.81 54.81 0 1 0-109.62 0Z" fill="#FFC800" p-id="1904"></path><path d="M319.6 233.84c-2.98 0-5.97-1.02-8.42-3.1-5.46-4.65-6.12-12.85-1.47-18.32 3.43-4.03 7.79-8.94 14.12-14.79 5.27-4.88 13.49-4.56 18.36 0.71 4.87 5.27 4.55 13.49-0.71 18.36-5.33 4.93-9.05 9.12-11.98 12.56a12.947 12.947 0 0 1-9.9 4.58zM268.4 330.3c-1.18 0-2.38-0.16-3.58-0.5-6.9-1.97-10.89-9.16-8.92-16.06 5.23-18.32 12.39-40.32 25.75-64.61 3.46-6.28 11.35-8.59 17.65-5.12 6.29 3.46 8.58 11.36 5.12 17.65-12.09 21.97-18.45 41.45-23.53 59.22-1.63 5.7-6.83 9.42-12.49 9.42z" fill="#FFFFFF" p-id="1905"></path></svg>'
            },
            {
                id: 2,
                name: "bangumi",
                title: "番剧",
                svg: '<svg t="1587718509099" class="icon" viewBox="0 0 1024 1024" version="1.1" xmlns="http://www.w3.org/2000/svg" p-id="2038" width="40" height="30"><path d="M0 194.56m81.92 0l860.16 0q81.92 0 81.92 81.92l0 573.44q0 81.92-81.92 81.92l-860.16 0q-81.92 0-81.92-81.92l0-573.44q0-81.92 81.92-81.92Z" fill="#69C0FF" p-id="2039"></path><path d="M143.36 921.6h122.88v30.72a40.96 40.96 0 0 1-40.96 40.96h-40.96a40.96 40.96 0 0 1-40.96-40.96v-30.72zM757.76 921.6h122.88v30.72a40.96 40.96 0 0 1-40.96 40.96h-40.96a40.96 40.96 0 0 1-40.96-40.96v-30.72z" fill="#40A9FF" p-id="2040"></path><path d="M92.16 307.2m81.92 0l450.56 0q81.92 0 81.92 81.92l0 348.16q0 81.92-81.92 81.92l-450.56 0q-81.92 0-81.92-81.92l0-348.16q0-81.92 81.92-81.92Z" fill="#91D5FF" p-id="2041"></path><path d="M865.28 363.52m-46.08 0a46.08 46.08 0 1 0 92.16 0 46.08 46.08 0 1 0-92.16 0Z" fill="#40A9FF" p-id="2042"></path><path d="M865.28 517.12m-46.08 0a46.08 46.08 0 1 0 92.16 0 46.08 46.08 0 1 0-92.16 0Z" fill="#40A9FF" p-id="2043"></path></svg>'
            },
            {
                id: 3,
                name: "guoman",
                title: "国漫",
                svg: '<svg t="1587718509099" class="icon" viewBox="0 0 1024 1024" version="1.1" xmlns="http://www.w3.org/2000/svg" p-id="2038" width="40" height="30"><path d="M0 194.56m81.92 0l860.16 0q81.92 0 81.92 81.92l0 573.44q0 81.92-81.92 81.92l-860.16 0q-81.92 0-81.92-81.92l0-573.44q0-81.92 81.92-81.92Z" fill="#69C0FF" p-id="2039"></path><path d="M143.36 921.6h122.88v30.72a40.96 40.96 0 0 1-40.96 40.96h-40.96a40.96 40.96 0 0 1-40.96-40.96v-30.72zM757.76 921.6h122.88v30.72a40.96 40.96 0 0 1-40.96 40.96h-40.96a40.96 40.96 0 0 1-40.96-40.96v-30.72z" fill="#40A9FF" p-id="2040"></path><path d="M92.16 307.2m81.92 0l450.56 0q81.92 0 81.92 81.92l0 348.16q0 81.92-81.92 81.92l-450.56 0q-81.92 0-81.92-81.92l0-348.16q0-81.92 81.92-81.92Z" fill="#91D5FF" p-id="2041"></path><path d="M865.28 363.52m-46.08 0a46.08 46.08 0 1 0 92.16 0 46.08 46.08 0 1 0-92.16 0Z" fill="#40A9FF" p-id="2042"></path><path d="M865.28 517.12m-46.08 0a46.08 46.08 0 1 0 92.16 0 46.08 46.08 0 1 0-92.16 0Z" fill="#40A9FF" p-id="2043"></path></svg>'
            },
            {
                id: 4,
                name: "theater",
                title: "电影",
                svg: '<svg t="1587718509099" class="icon" viewBox="0 0 1024 1024" version="1.1" xmlns="http://www.w3.org/2000/svg" p-id="2038" width="40" height="30"><path d="M0 194.56m81.92 0l860.16 0q81.92 0 81.92 81.92l0 573.44q0 81.92-81.92 81.92l-860.16 0q-81.92 0-81.92-81.92l0-573.44q0-81.92 81.92-81.92Z" fill="#69C0FF" p-id="2039"></path><path d="M143.36 921.6h122.88v30.72a40.96 40.96 0 0 1-40.96 40.96h-40.96a40.96 40.96 0 0 1-40.96-40.96v-30.72zM757.76 921.6h122.88v30.72a40.96 40.96 0 0 1-40.96 40.96h-40.96a40.96 40.96 0 0 1-40.96-40.96v-30.72z" fill="#40A9FF" p-id="2040"></path><path d="M92.16 307.2m81.92 0l450.56 0q81.92 0 81.92 81.92l0 348.16q0 81.92-81.92 81.92l-450.56 0q-81.92 0-81.92-81.92l0-348.16q0-81.92 81.92-81.92Z" fill="#91D5FF" p-id="2041"></path><path d="M865.28 363.52m-46.08 0a46.08 46.08 0 1 0 92.16 0 46.08 46.08 0 1 0-92.16 0Z" fill="#40A9FF" p-id="2042"></path><path d="M865.28 517.12m-46.08 0a46.08 46.08 0 1 0 92.16 0 46.08 46.08 0 1 0-92.16 0Z" fill="#40A9FF" p-id="2043"></path></svg>'
            },
            {
                id: 5,
                name: "filmtv",
                title: "剧集",
                svg: '<svg t="1587718509099" class="icon" viewBox="0 0 1024 1024" version="1.1" xmlns="http://www.w3.org/2000/svg" p-id="2038" width="40" height="30"><path d="M0 194.56m81.92 0l860.16 0q81.92 0 81.92 81.92l0 573.44q0 81.92-81.92 81.92l-860.16 0q-81.92 0-81.92-81.92l0-573.44q0-81.92 81.92-81.92Z" fill="#69C0FF" p-id="2039"></path><path d="M143.36 921.6h122.88v30.72a40.96 40.96 0 0 1-40.96 40.96h-40.96a40.96 40.96 0 0 1-40.96-40.96v-30.72zM757.76 921.6h122.88v30.72a40.96 40.96 0 0 1-40.96 40.96h-40.96a40.96 40.96 0 0 1-40.96-40.96v-30.72z" fill="#40A9FF" p-id="2040"></path><path d="M92.16 307.2m81.92 0l450.56 0q81.92 0 81.92 81.92l0 348.16q0 81.92-81.92 81.92l-450.56 0q-81.92 0-81.92-81.92l0-348.16q0-81.92 81.92-81.92Z" fill="#91D5FF" p-id="2041"></path><path d="M865.28 363.52m-46.08 0a46.08 46.08 0 1 0 92.16 0 46.08 46.08 0 1 0-92.16 0Z" fill="#40A9FF" p-id="2042"></path><path d="M865.28 517.12m-46.08 0a46.08 46.08 0 1 0 92.16 0 46.08 46.08 0 1 0-92.16 0Z" fill="#40A9FF" p-id="2043"></path></svg>'
            },
            {
                id: 6,
                name: "news",
                title: "资讯",
                svg: '<svg t="1587718560862" class="icon" viewBox="0 0 1024 1024" version="1.1" xmlns="http://www.w3.org/2000/svg" p-id="3511" width="40" height="30"><path d="M1042.52952427 551.00952427L891.69269867 69.892064 124.50539733 233.732064l36.40888854 119.62920533-179.44381014 46.81142934S64.6907936 668.03809493 121.9047616 844.88126933s189.8463488 93.6228576 189.84634987 93.6228576S891.69269867 694.0444448 980.11428587 657.6355552c80.61968213-36.40888853 62.4152384-106.626032 62.4152384-106.62603093zM181.71936533 813.6736512l-114.42793706-364.0888896 114.42793706-26.0063488 140.43428587 473.3155552 49.41206293-31.2076192c-156.03809493 83.22031787-189.8463488-52.01269867-189.8463488-52.0126976zM954.107936 616.02539733s-109.22666667 41.61015893-239.25841173 96.2234912l-83.22031787-262.66412693-270.466032 83.22031787L454.786032 824.07619093c-26.0063488 13.0031744-52.01269867 23.40571413-70.21714347 33.80825387L244.13460267 407.97460267l-39.0095232-124.83047574 668.3631744-153.43746026s104.02539733 330.28063467 124.8304768 397.8971424C1019.12380907 590.01904747 954.107936 616.02539733 954.107936 616.02539733z" fill="#ff9900" p-id="3512"></path><path d="M912.49777813 376.76698453l-223.65460373 70.2171424 18.2044448 54.61333334 223.65460267-75.4184128-18.20444374-49.41206294zM717.45015893 540.60698453l18.20444374 54.61333334 221.05396906-80.6196832-15.60381013-52.01269867-223.65460267 78.01904853zM410.5752384 290.946032l13.0031744 44.2107936c7.80190507 23.40571413 15.60380907 44.2107936 23.40571413 65.01587307-13.0031744-15.60380907-28.60698453-31.2076192-41.61015893-46.81142934l-52.01269867-49.41206293-44.2107936 10.40253973 49.412064 158.6387296 33.80825387-10.40253973-15.60380907-46.81142827c-7.80190507-26.0063488-15.60380907-46.81142827-23.4057152-67.61650773 13.0031744 15.60380907 31.2076192 33.80825387 46.81142934 46.81142827l52.01269866 49.412064 36.40888854-10.40253974-46.81142827-153.43746026-31.2076192 10.40253973zM545.80825387 389.77015893l-10.40253974-36.4088896 54.61333334-15.60380906-7.80190507-26.0063488-54.61333333 15.60380906-10.40253974-31.2076192 57.21396907-15.60380906L564.01269867 251.93650773l-91.02222294 23.40571414 46.81142934 150.8368256 93.62285653-28.60698347-7.801904-28.60698453-59.81460373 20.80507946zM686.24253973 309.15047573c0-15.60380907-2.60063467-28.60698453-5.2012704-46.81142826 7.80190507 15.60380907 13.0031744 28.60698453 20.80507947 41.61015893l31.2076192 57.213968 31.2076192-10.40253973-10.40253973-148.23618987-31.2076192 7.801904 7.80190506 59.81460373c2.60063467 18.2044448 5.20126933 33.80825387 7.80190507 52.01269867-7.80190507-15.60380907-13.0031744-28.60698453-20.80507947-46.81142933l-28.60698453-57.213968-33.80825387 7.80190506 7.80190507 62.4152384 7.80190507 54.61333334c-7.80190507-13.0031744-15.60380907-31.2076192-23.4057152-49.412064l-31.20761814-52.01269867-33.80825493 7.80190507 80.6196832 137.8336512 33.80825387-10.40253974-10.40253974-67.6165088zM824.07619093 275.34222187c15.60380907 2.60063467 23.40571413 5.20126933 26.0063488 13.00317546 2.60063467 7.80190507-2.60063467 15.60380907-15.60380906 20.8050784-13.0031744 2.60063467-26.0063488 2.60063467-33.80825494 0l2.60063574 28.60698454c7.80190507 2.60063467 23.40571413 2.60063467 39.0095232-2.60063467 33.80825387-10.40253973 41.61015893-33.80825387 36.4088896-57.213968-5.20126933-18.2044448-20.80507947-28.60698453-44.2107936-31.2076192-18.2044448-2.60063467-26.0063488-5.20126933-28.60698454-13.0031744-2.60063467-7.80190507 2.60063467-15.60380907 13.0031744-18.2044448 13.0031744-2.60063467 20.80507947-2.60063467 28.60698454 0l-2.60063574-26.00634987c-7.80190507-2.60063467-18.2044448-2.60063467-33.80825386 0-28.60698453 7.80190507-41.61015893 28.60698453-33.80825387 52.01269867 5.20126933 20.80507947 23.40571413 31.2076192 46.81142933 33.80825387z" fill="#5cadff" p-id="3513"></path></svg>'
            },
            {
                id: 7,
                name: "announce",
                title: "公告",
                svg: '<svg t="1587718583365" class="icon" viewBox="0 0 1024 1024" version="1.1" xmlns="http://www.w3.org/2000/svg" p-id="3646" width="40" height="30"><path d="M896 281.6H128c-14.933333 0-27.733333-8.533333-29.866667-23.466667s2.133333-27.733333 14.933334-36.266666l317.866666-194.133334c51.2-32 115.2-32 166.4 0l317.866667 194.133334c12.8 8.533333 17.066667 21.333333 14.933333 36.266666-6.4 14.933333-19.2 23.466667-34.133333 23.466667z m-654.933333-64h539.733333L561.066667 83.2c-29.866667-19.2-68.266667-19.2-100.266667 0l-219.733333 134.4z" fill="#7172EC" p-id="3647"></path><path d="M85.333333 192h853.333334c46.933333 0 85.333333 38.4 85.333333 85.333333v661.333334c0 46.933333-38.4 85.333333-85.333333 85.333333H85.333333c-46.933333 0-85.333333-38.4-85.333333-85.333333V277.333333c0-46.933333 38.4-85.333333 85.333333-85.333333z" fill="#9193F1" p-id="3648"></path><path d="M149.333333 256h725.333334c46.933333 0 85.333333 38.4 85.333333 85.333333v533.333334c0 46.933333-38.4 85.333333-85.333333 85.333333H149.333333c-46.933333 0-85.333333-38.4-85.333333-85.333333V341.333333c0-46.933333 38.4-85.333333 85.333333-85.333333z" fill="#6365EC" p-id="3649"></path><path d="M768 490.666667c-164.266667 0-298.666667 134.4-298.666667 298.666666 0 64 19.2 121.6 53.333334 170.666667H874.666667c46.933333 0 85.333333-38.4 85.333333-85.333333V561.066667c-51.2-44.8-119.466667-70.4-192-70.4z" fill="#7172EC" p-id="3650"></path><path d="M486.4 576H234.666667c-17.066667 0-32-14.933333-32-32S217.6 512 234.666667 512h251.733333c17.066667 0 32 14.933333 32 32s-12.8 32-32 32zM789.333333 746.666667H234.666667c-17.066667 0-32-14.933333-32-32S217.6 682.666667 234.666667 682.666667h554.666666c17.066667 0 32 14.933333 32 32S806.4 746.666667 789.333333 746.666667z" fill="#FFFFFF" p-id="3651"></path></svg>'
            }
        ],
        // 今日热播
        hotPlayList: [
            {
                id: 1,
                title: '八男？别闹了！',
                latestChapter: '04',
                imgSrc: '@/../static/imgs/hotplay/'
            },
            {
                id: 2,
                title: '异种族风俗娘评鉴指南',
                latestChapter: '12',
                imgSrc: '@/../static/imgs/hotplay/'
            },
            {
                id: 3,
                title: '隐瞒之事',
                latestChapter: '04',
                imgSrc: '@/../static/imgs/hotplay/'
            },
            {
                id: 4,
                title: '一人之下 第三季',
                latestChapter: '02',
                imgSrc: '@/../static/imgs/hotplay/'
            },
            {
                id: 5,
                title: '攻壳机动队：SAC_2045',
                latestChapter: '12',
                imgSrc: '@/../static/imgs/hotplay/'
            },
            {
                id: 6,
                title: '海贼王',
                latestChapter: '929',
                imgSrc: '@/../static/imgs/hotplay/'
            }
        ],
        // 新番时间表
        fanTimeTable: [
            // 星期一
            [
                {
                    id: 1,
                    title: '啄木鸟侦探社！',
                    latestChapter: '02',
                    imgSrc: 'http://wxt.sinaimg.cn/mw690/0076NW5Ngy1ge47ykli2ij307i0al0tt.jpg'
                },
                {
                    id: 2,
                    title: '白猫计划 零之纪元',
                    latestChapter: '03',
                    imgSrc: 'https://tva1.sinaimg.cn/large/005Bbswmgy1gdk4qs21n9j307i0amq3h.jpg'
                },
                {
                    id: 3,
                    title: '公主连结！ Re:Dive',
                    latestChapter: '03',
                    imgSrc: 'http://img9.doubanio.com/view/photo/l/public/p2585851306.jpg'
                },
                {
                    id: 4,
                    title: '女学。～圣女斯克威尔学院～',
                    latestChapter: '03',
                    imgSrc: 'http://img9.doubanio.com/view/photo/l/public/p2595662585.jpg'
                },
                {
                    id: 5,
                    title: '王者天下 第三季',
                    latestChapter: '03',
                    imgSrc: 'http://img3.doubanio.com/view/photo/l/public/p2593869371.jpg'
                },
                {
                    id: 6,
                    title: '超级小白',
                    latestChapter: '28',
                    imgSrc: 'https://wxt.sinaimg.cn/large/006MDjU7ly1g7y13lzyqaj307i0am3z8.jpg'
                },
                {
                    id: 7,
                    title: '社长，战斗的时间到了！',
                    latestChapter: '03',
                    imgSrc: 'http://img9.doubanio.com/view/photo/l/public/p2587947855.jpg'
                },
                {
                    id: 8,
                    title: '八十龟酱观察日记',
                    latestChapter: '03',
                    imgSrc: 'https://tva3.sinaimg.cn/large/006MDjU7gy1g1gpczkq01j307i0alwf3.jpg'
                },
                {
                    id: 9,
                    title: '邪神与厨二病少女 第二季',
                    latestChapter: '11',
                    imgSrc: 'http://img9.doubanio.com/view/photo/l/public/p2586880256.jpg'
                },
                {
                    id: 10,
                    title: '巴比伦',
                    latestChapter: '12',
                    imgSrc: 'https://wxt.sinaimg.cn/large/006MDjU7ly1g7q2ks5b7rj307i0ammxm.jpg'
                }
            ],
            // 星期二
            [
                {
                    id: 1,
                    title: '放学后海堤日记',
                    latestChapter: '03',
                    imgSrc: 'https://sc01.alicdn.com/kf/U75ecd8f60d904635998d534bb9186650t.jpg'
                },
                {
                    id: 2,
                    title: '黑色五叶草',
                    latestChapter: '131',
                    imgSrc: 'http://img9.doubanio.com/view/photo/l/public/p2496389055.jpg'
                },
                {
                    id: 3,
                    title: '影之诗',
                    latestChapter: '03',
                    imgSrc: 'http://img3.doubanio.com/view/photo/l/public/p2579946731.jpg'
                },
                {
                    id: 4,
                    title: '水果篮子 第二季',
                    latestChapter: '03',
                    imgSrc: 'http://img3.doubanio.com/view/photo/l/public/p2589217560.jpg'
                },
                {
                    id: 5,
                    title: '噬血狂袭Ⅳ',
                    latestChapter: '02',
                    imgSrc: 'http://img3.doubanio.com/view/photo/l/public/p2577741122.jpg'
                },
                {
                    id: 6,
                    title: '超级小白',
                    latestChapter: '28',
                    imgSrc: 'https://wxt.sinaimg.cn/large/006MDjU7ly1g7y13lzyqaj307i0am3z8.jpg'
                },
                {
                    id: 7,
                    title: '超龙珠英雄',
                    latestChapter: '20',
                    imgSrc: 'https://tva3.sinaimg.cn/large/006MDjU7gy1g0dyvxmjomj307i0a63ze.jpg'
                },
                {
                    id: 8,
                    title: 'A3！满开剧团',
                    latestChapter: '03',
                    imgSrc: 'https://wxt.sinaimg.cn/large/006MDjU7ly1gaxknt1laej307i0amq35.jpg'
                }
            ],
            // 星期三
            [
                {
                    id: 1,
                    title: '神之塔',
                    latestChapter: '04',
                    imgSrc: 'http://img3.doubanio.com/view/photo/l/public/p2589007083.jpg'
                },
                {
                    id: 2,
                    title: '球咏',
                    latestChapter: '04',
                    imgSrc: 'https://sc01.alicdn.com/kf/U32dbe3137d0246e19611760899e987bby.jpg'
                },
                {
                    id: 3,
                    title: '篮球少年王',
                    latestChapter: '27',
                    imgSrc: 'https://wxt.sinaimg.cn/large/006MDjU7ly1g7q2k5ty29j307i0ac74v.jpg'
                },
                {
                    id: 4,
                    title: '妖神记之黑狱篇',
                    latestChapter: '06',
                    imgSrc: 'http://img9.doubanio.com/view/photo/l/public/p2594784874.jpg'
                },
                {
                    id: 5,
                    title: 'title="瑞克和莫蒂 第四季"',
                    latestChapter: '05',
                    imgSrc: 'https://wxt.sinaimg.cn/large/006MDjU7ly1g8wrxoatmhj307i0b90sz.jpg'
                }
            ],
            // 星期四
            [
                {
                    id: 1,
                    title: '攻壳机动队：SAC_2045',
                    latestChapter: '12',
                    imgSrc: 'https://sc01.alicdn.com/kf/U2c166924eddd4483b918a94dfc42e2c5A.jpg'
                },
                {
                    id: 2,
                    title: '隐瞒之事',
                    latestChapter: '04',
                    imgSrc: 'https://sc01.alicdn.com/kf/Udf16cdc1555e4552a9b47b5e9611885e7.jpg'
                },
                {
                    id: 3,
                    title: '八男？别闹了！',
                    latestChapter: '04',
                    imgSrc: 'http://img3.doubanio.com/view/photo/l/public/p2561728381.jpg'
                },
                {
                    id: 4,
                    title: '高达创形者 Re:RISE 第二季',
                    latestChapter: '03',
                    imgSrc: 'http://img1.doubanio.com/view/photo/l/public/p2588442169.jpg'
                },
                {
                    id: 5,
                    title: '星掠者',
                    latestChapter: '15',
                    imgSrc: 'https://wxt.sinaimg.cn/large/006MDjU7ly1gapo5e5dvej306908c0t2.jpg'
                },
                {
                    id: 6,
                    title: '宝可梦：破晓之翼',
                    latestChapter: '04',
                    imgSrc: 'https://wxt.sinaimg.cn/large/006MDjU7ly1gaylc9xle3j307i0a9aad.jpg'
                },
                {
                    id: 7,
                    title: '奇幻☆怪盗',
                    latestChapter: '11',
                    imgSrc: 'https://wxt.sinaimg.cn/large/006MDjU7ly1g8ugmlvco8j307i0b53z3.jpg'
                },
                {
                    id: 8,
                    title: '碧蓝航线',
                    latestChapter: '12',
                    imgSrc: 'https://wxt.sinaimg.cn/large/006MDjU7ly1g7q2kqvdd6j30u0162wo8.jpg'
                }
            ],
            // 星期五
            [
                {
                    id: 1,
                    title: '一人之下 第三季',
                    latestChapter: '02',
                    imgSrc: 'https://sc01.alicdn.com/kf/Uae39223ee0d0408f900bc74251a523e3A.jpg'
                },
                {
                    id: 2,
                    title: '棒球大联盟2nd 第二季',
                    latestChapter: '03',
                    imgSrc: 'http://img9.doubanio.com/view/photo/l/public/p2595491774.jpg'
                },
                {
                    id: 3,
                    title: '新樱花大战',
                    latestChapter: '03',
                    imgSrc: 'http://img1.doubanio.com/view/photo/l/public/p2585620607.jpg'
                },
                {
                    id: 4,
                    title: '武庚纪 第三季',
                    latestChapter: '90',
                    imgSrc: 'https://wxt.sinaimg.cn/large/006MDjU7ly1gcl9f0v2elj307i0b9aal.jpg'
                },
                {
                    id: 5,
                    title: '座敷童子榻榻米酱',
                    latestChapter: '02',
                    imgSrc: 'http://img3.doubanio.com/view/photo/l/public/p2581845992.jpg'
                }
            ],
            // 星期六
            [
                {
                    id: 1,
                    title: '阿尔蒂',
                    latestChapter: '03',
                    imgSrc: 'https://sc01.alicdn.com/kf/Ue6c5f89302914e40b8e1e8f4bbde0554z.jpg'
                },
                {
                    id: 2,
                    title: '斗罗大陆',
                    latestChapter: '100',
                    imgSrc: 'http://img3.doubanio.com/view/photo/l/public/p2510966013.jpg'
                },
                {
                    id: 3,
                    title: '听我的电波吧',
                    latestChapter: '03',
                    imgSrc: 'http://img3.doubanio.com/view/photo/l/public/p2579946731.jpg'
                },
                {
                    id: 4,
                    title: '聆听者',
                    latestChapter: '03',
                    imgSrc: 'src="https://sc01.alicdn.com/kf/Uabe37b7021d941459904750c98a8966dm.jpg"'
                }
            ],
            // 星期天
            [
                {
                    id: 1,
                    title: '我开动物园那些年',
                    latestChapter: '04',
                    imgSrc: 'http://sc01.alicdn.com/kf/H6a2748274c414400b5979fd7563471d4W.jpg'
                },
                {
                    id: 2,
                    title: '格莱普尼尔',
                    latestChapter: '03',
                    imgSrc: 'http://img3.doubanio.com/view/photo/l/public/p2595428641.jpg'
                },
                {
                    id: 3,
                    title: '火影忍者：博人传之次世代继承者',
                    latestChapter: '153',
                    imgSrc: 'https://wxt.sinaimg.cn/large/006MDjU7ly1gc6jrdvf9oj307i0ak3z7.jpg'
                },
                {
                    id: 4,
                    title: '闪亮美妙☆频道',
                    latestChapter: '105',
                    imgSrc: 'https://wxt.sinaimg.cn/large/006MDjU7ly1gc6jqfcfrcj307i0a0dgb.jpg'
                },
                {
                    id: 5,
                    title: '偶像星愿 第二季',
                    latestChapter: '04',
                    imgSrc: 'http://img1.doubanio.com/view/photo/l/public/p2589698789.jpg'
                },
                {
                    id: 6,
                    title: '怪怪守护神 第二季',
                    latestChapter: '03',
                    imgSrc: 'http://img1.doubanio.com/view/photo/l/public/p2588061727.jpg'
                },
                {
                    id: 7,
                    title: '游戏王SEVENS',
                    latestChapter: '03',
                    imgSrc: 'http://img3.doubanio.com/view/photo/l/public/p2579434820.jpg'
                }
            ],
        ],
        // 新番放送
        rimanList: [
            {
                id: 1,
                title: '攻壳机动队：SAC_2045',
                latestChapter: '12',
                imgSrc: '@/../static/imgs/newfan/'
            },
            {
                id: 2,
                title: '隐瞒之事',
                latestChapter: '04',
                imgSrc: '@/../static/imgs/newfan/'

            },
            {
                id: 3,
                title: '八男？别闹了！',
                latestChapter: '04',
                imgSrc: '@/../static/imgs/newfan/'
            },
            {
                id: 4,
                title: '高达创形者 Re:RISE 第二季',
                latestChapter: '03',
                imgSrc: '@/../static/imgs/newfan/'
            },
            {
                id: 5,
                title: '星掠者',
                latestChapter: '15',
                imgSrc: '@/../static/imgs/newfan/'
            },
            {
                id: 6,
                title: '神之塔',
                latestChapter: '04',
                imgSrc: '@/../static/imgs/newfan/'
            },
            {
                id: 7,
                title: '球咏',
                latestChapter: '04',
                imgSrc: '@/../static/imgs/newfan/'
            },
            {
                id: 8,
                title: '篮球少年王',
                latestChapter: '27',
                imgSrc: '@/../static/imgs/newfan/'
            },
            {
                id: 9,
                title: '放学后海堤日记',
                latestChapter: '03',
                imgSrc: '@/../static/imgs/newfan/'
            },
            {
                id: 10,
                title: '黑色五叶草',
                latestChapter: '131',
                imgSrc: '@/../static/imgs/newfan/'
            },
            {
                id: 11,
                title: '影之诗',
                latestChapter: '03',
                imgSrc: '@/../static/imgs/newfan/'
            },
            {
                id: 12,
                title: '水果篮子 第二季',
                latestChapter: '03',
                imgSrc: '@/../static/imgs/newfan/'
            }
        ],
        // 国产动漫
        guomanList: [
        //     {
        //         id: 1,
        //         title: '一人之下 第三季',
        //         latestChapter: '02',
        //         imgSrc: '@/../static/imgs/guochuang/'
        //     },
        //     {
        //         id: 2,
        //         title: '我开动物园那些年',
        //         latestChapter: '04',
        //         imgSrc: '@/../static/imgs/guochuang/'
        //     },
        //     {
        //         id: 3,
        //         title: '妖神记之黑狱篇',
        //         latestChapter: '06',
        //         imgSrc: '@/../static/imgs/guochuang/'
        //     },
        //     {
        //         id: 4,
        //         title: '斗罗大陆 Re:RISE 第二季',
        //         latestChapter: '100',
        //         imgSrc: '@/../static/imgs/guochuang/'
        //     },
        //     {
        //         id: 5,
        //         title: '武庚纪 第三季',
        //         latestChapter: '90',
        //         imgSrc: '@/../static/imgs/guochuang/'
        //     },
        //     {
        //         id: 6,
        //         title: '妖精种植手册',
        //         latestChapter: '14',
        //         imgSrc: '@/../static/imgs/guochuang/'
        //     },
        //     {
        //         id: 7,
        //         title: '今天开始做明星',
        //         latestChapter: '12',
        //         imgSrc: '@/../static/imgs/guochuang/'
        //     },
        //     {
        //         id: 8,
        //         title: '剑网3·侠肝义胆沈剑心 第一季',
        //         latestChapter: '12',
        //         imgSrc: '@/../static/imgs/guochuang/'
        //     },
        //     {
        //         id: 9,
        //         title: '剑网3·侠肝义胆沈剑心 第二季',
        //         latestChapter: '12',
        //         imgSrc: '@/../static/imgs/guochuang/'
        //     },
        //     {
        //         id: 10,
        //         title: '从前有座灵剑山 第二季',
        //         latestChapter: '12',
        //         imgSrc: '@/../static/imgs/guochuang/'
        //     },
        //     {
        //         id: 11,
        //         title: '从前有座灵剑山',
        //         latestChapter: '12',
        //         imgSrc: '@/../static/imgs/guochuang/'
        //     },
        //     {
        //         id: 12,
        //         title: '仙王的日常生活',
        //         latestChapter: '15',
        //         imgSrc: '@/../static/imgs/guochuang/'
        //     }
        ],
        // 番组计划
        bangumiList: [
            
        ],
        // 剧场动画
        theaterList: [
            // {
            //     id: 1,
            //     title: '只想受你欢迎',
            //     latestChapter: 'BD720P',
            //     imgSrc: '@/../static/imgs/theater/'
            // },
            // {
            //     id: 2,
            //     title: '假面骑士时王：盖茨王权',
            //     latestChapter: 'BD720P',
            //     imgSrc: '@/../static/imgs/theater/'
            // },
            // {
            //     id: 3,
            //     title: '假面骑士Agito 特别篇 新的变身',
            //     latestChapter: 'BD720P',
            //     imgSrc: '@/../static/imgs/theater/'
            // },
            // {
            //     id: 4,
            //     title: '路人女主的养成方法 Fine',
            //     latestChapter: 'BD720P',
            //     imgSrc: '@/../static/imgs/theater/'
            // },
            // {
            //     id: 5,
            //     title: '你好世界',
            //     latestChapter: 'BD720P',
            //     imgSrc: '@/../static/imgs/theater/'
            // },
            // {
            //     id: 6,
            //     title: '星际牛仔：天国之门',
            //     latestChapter: 'BD720P',
            //     imgSrc: '@/../static/imgs/theater/'
            // },
            // {
            //     id: 7,
            //     title: 'Re：从零开始的异世界生活 冰结之绊',
            //     latestChapter: 'BD720P',
            //     imgSrc: '@/../static/imgs/theater/'
            // },
            // {
            //     id: 8,
            //     title: '星游记之风暴法米拉Ⅱ',
            //     latestChapter: 'BD720P',
            //     imgSrc: '@/../static/imgs/theater/'
            // },
            // {
            //     id: 9,
            //     title: '圣诞老人公司',
            //     latestChapter: 'BD720P',
            //     imgSrc: '@/../static/imgs/theater/'
            // },
            // {
            //     id: 10,
            //     title: '心理测量者3：第一监视者',
            //     latestChapter: 'BD720P',
            //     imgSrc: '@/../static/imgs/theater/'
            // },
            // {
            //     id: 11,
            //     title: '我们的七日战争',
            //     latestChapter: 'BD720P',
            //     imgSrc: '@/../static/imgs/theater/'
            // },
            // {
            //     id: 12,
            //     title: '为美好的世界献上祝福！红传说',
            //     latestChapter: 'BD720P',
            //     imgSrc: '@/../static/imgs/theater/'
            // }
        ],
        // 影视
        filmtvList: [
            // {
            //     id: 1,
            //     title: '清平乐',
            //     latestChapter: '19',
            //     imgSrc: '@/../static/imgs/filmTV/'            },
            // {
            //     id: 2,
            //     title: '龙岭迷窟',
            //     latestChapter: 'BD720P',
            //     imgSrc: '@/../static/imgs/filmTV/'             },
            // {
            //     id: 3,
            //     title: '刺猬索尼克',
            //     latestChapter: 'HD1080P',
            //     imgSrc: '@/../static/imgs/filmTV/'             },
            // {
            //     id: 4,
            //     title: '我是大哥大',
            //     latestChapter: '10',
            //     imgSrc: '@/../static/imgs/filmTV/'             },
            // {
            //     id: 5,
            //     title: '误杀',
            //     latestChapter: 'BD720P',
            //     imgSrc: '@/../static/imgs/filmTV/'             },
            // {
            //     id: 6,
            //     title: '三生三世枕上书',
            //     latestChapter: 'BD720P',
            //     imgSrc: '@/../static/imgs/filmTV/'             },
            // {
            //     id: 7,
            //     title: '无心法师',
            //     latestChapter: 'BD720P',
            //     imgSrc: '@/../static/imgs/filmTV/'             },
            // {
            //     id: 8,
            //     title: '叶问4：完结篇',
            //     latestChapter: 'BD720P',
            //     imgSrc: '@/../static/imgs/filmTV/'             },
            // {
            //     id: 9,
            //     title: '唐人街探案',
            //     latestChapter: 'BD720P',
            //     imgSrc: '@/../static/imgs/filmTV/'             },
            // {
            //     id: 10,
            //     title: '将夜2',
            //     latestChapter: 'BD720P',
            //     imgSrc: '@/../static/imgs/filmTV/'             },
            // {
            //     id: 11,
            //     title: '小丑',
            //     latestChapter: 'BD720P',
            //     imgSrc: '@/../static/imgs/filmTV/'             },
            // {
            //     id: 12,
            //     title: '爱宠大机密2',
            //     latestChapter: 'BD720P',
            //     imgSrc: '@/../static/imgs/filmTV/'             }
        ],
        // 搜索结果
        serhResultList: [
            // {
            //     id: 1,
            //     title: '清平乐',
            //     latestChapter: '19',
            //     imgSrc: 'http://img1.doubanio.com/view/photo/l/public/p2593859919.jpg'
            // },
            // {
            //     id: 2,
            //     title: '龙岭迷窟',
            //     latestChapter: 'BD720P',
            //     imgSrc: 'http://img9.doubanio.com/view/photo/l/public/p2593664928.jpg'
            // },
            // {
            //     id: 3,
            //     title: '刺猬索尼克',
            //     latestChapter: 'HD1080P',
            //     imgSrc: 'http://img9.doubanio.com/view/photo/l/public/p2582485085.jpg'
            // },
            // {
            //     id: 4,
            //     title: '我是大哥大',
            //     latestChapter: '10',
            //     imgSrc: 'https://tva3.sinaimg.cn/large/006MDjU7gy1g0dyt3a1mwj307i08o0ta.jpg'
            // },
            // {
            //     id: 5,
            //     title: '误杀',
            //     latestChapter: 'BD720P',
            //     imgSrc: 'https://wxt.sinaimg.cn/large/006MDjU7ly1gcwsp1znj8j307i0ah74m.jpg'
            // },
            // {
            //     id: 6,
            //     title: '三生三世枕上书',
            //     latestChapter: 'BD720P',
            //     imgSrc: 'https://wxt.sinaimg.cn/large/006MDjU7ly1gck9hru5ucj307i0aiq31.jpg'
            // },
            // {
            //     id: 7,
            //     title: '无心法师',
            //     latestChapter: 'BD720P',
            //     imgSrc: 'https://wxt.sinaimg.cn/large/006MDjU7ly1gcbh2htiozj307i0b9q3i.jpg'
            // },
            // {
            //     id: 8,
            //     title: '叶问4：完结篇',
            //     latestChapter: 'BD720P',
            //     imgSrc: 'https://wxt.sinaimg.cn/large/006MDjU7ly1gbri3jipdtj307i0ahjru.jpg'
            // },
            // {
            //     id: 9,
            //     title: '唐人街探案',
            //     latestChapter: 'BD720P',
            //     imgSrc: 'https://wxt.sinaimg.cn/large/006MDjU7ly1gbjm4fq6uwj307i0ah0ss.jpg'
            // },
            // {
            //     id: 10,
            //     title: '将夜2',
            //     latestChapter: 'BD720P',
            //     imgSrc: 'https://wxt.sinaimg.cn/large/006MDjU7ly1gb2cwufe2hj307i0aiaag.jpg'
            // },
            // {
            //     id: 11,
            //     title: '小丑',
            //     latestChapter: 'BD720P',
            //     imgSrc: 'https://wxt.sinaimg.cn/large/006MDjU7ly1g8t5g2yhqxj307i0b4t92.jpg'
            // },
            // {
            //     id: 12,
            //     title: '爱宠大机密2',
            //     latestChapter: 'BD720P',
            //     imgSrc: 'https://wxt.sinaimg.cn/large/006MDjU7ly1g7vs0msu93j307i0apglk.jpg'
            // },
            // {
            //     id: 13,
            //     title: '攻壳机动队：SAC_2045',
            //     latestChapter: '12',
            //     imgSrc: 'https://sc01.alicdn.com/kf/U2c166924eddd4483b918a94dfc42e2c5A.jpg'
            // },
            // {
            //     id: 14,
            //     title: '隐瞒之事',
            //     latestChapter: '04',
            //     imgSrc: 'https://sc01.alicdn.com/kf/Udf16cdc1555e4552a9b47b5e9611885e7.jpg'
            // },
            // {
            //     id: 15,
            //     title: '八男？别闹了！',
            //     latestChapter: '04',
            //     imgSrc: 'http://img3.doubanio.com/view/photo/l/public/p2561728381.jpg'
            // },
            // {
            //     id: 16,
            //     title: '高达创形者 Re:RISE 第二季',
            //     latestChapter: '03',
            //     imgSrc: 'http://img1.doubanio.com/view/photo/l/public/p2588442169.jpg'
            // },
            // {
            //     id: 17,
            //     title: '星掠者',
            //     latestChapter: '15',
            //     imgSrc: 'https://wxt.sinaimg.cn/large/006MDjU7ly1gapo5e5dvej306908c0t2.jpg'
            // },
            // {
            //     id: 18,
            //     title: '神之塔',
            //     latestChapter: '04',
            //     imgSrc: 'http://img3.doubanio.com/view/photo/l/public/p2589007083.jpg'
            // },
            // {
            //     id: 19,
            //     title: '球咏',
            //     latestChapter: '04',
            //     imgSrc: 'https://sc01.alicdn.com/kf/U32dbe3137d0246e19611760899e987bby.jpg'
            // },
            // {
            //     id: 20,
            //     title: '篮球少年王',
            //     latestChapter: '27',
            //     imgSrc: 'https://wxt.sinaimg.cn/large/006MDjU7ly1g7q2k5ty29j307i0ac74v.jpg'
            // },
            // {
            //     id: 21,
            //     title: '放学后海堤日记',
            //     latestChapter: '03',
            //     imgSrc: 'https://sc01.alicdn.com/kf/U75ecd8f60d904635998d534bb9186650t.jpg'
            // },
            // {
            //     id: 22,
            //     title: '黑色五叶草',
            //     latestChapter: '131',
            //     imgSrc: 'http://img9.doubanio.com/view/photo/l/public/p2496389055.jpg'
            // },
            // {
            //     id: 23,
            //     title: '影之诗',
            //     latestChapter: '03',
            //     imgSrc: 'http://img3.doubanio.com/view/photo/l/public/p2579946731.jpg'
            // },
            // {
            //     id: 24,
            //     title: '水果篮子 第二季',
            //     latestChapter: '03',
            //     imgSrc: 'http://img3.doubanio.com/view/photo/l/public/p2589217560.jpg'
            // },
            // {
            //     id: 25,
            //     title: '只想受你欢迎',
            //     latestChapter: 'BD720P',
            //     imgSrc: 'https://img3.doubanio.com/view/photo/l/public/p2567242893.jpg'
            // },
            // {
            //     id: 26,
            //     title: '假面骑士时王：盖茨王权',
            //     latestChapter: 'BD720P',
            //     imgSrc: 'https://sc01.alicdn.com/kf/Udd6e34351ed34dd2a4606c13504122c5y.jpg'
            // },
            // {
            //     id: 27,
            //     title: '假面骑士Agito 特别篇 新的变身',
            //     latestChapter: 'BD720P',
            //     imgSrc: 'http://img1.doubanio.com/view/photo/l/public/p2551844248.jpg'
            // },
            // {
            //     id: 28,
            //     title: '路人女主的养成方法 Fine',
            //     latestChapter: 'BD720P',
            //     imgSrc: 'http://img1.doubanio.com/view/photo/l/public/p2543633829.jpg'
            // },
            // {
            //     id: 29,
            //     title: '你好世界',
            //     latestChapter: 'BD720P',
            //     imgSrc: 'http://img1.doubanio.com/view/photo/l/public/p2594764469.jpg'
            // },
            // {
            //     id: 30,
            //     title: '星际牛仔：天国之门',
            //     latestChapter: 'BD720P',
            //     imgSrc: 'http://img3.doubanio.com/view/photo/l/public/p454096953.jpg'
            // },
            // {
            //     id: 31,
            //     title: 'Re：从零开始的异世界生活 冰结之绊',
            //     latestChapter: 'BD720P',
            //     imgSrc: 'http://img9.doubanio.com/view/photo/l/public/p2564850964.jpg'
            // },
            // {
            //     id: 32,
            //     title: '星游记之风暴法米拉Ⅱ',
            //     latestChapter: 'BD720P',
            //     imgSrc: 'https://wxt.sinaimg.cn/large/006MDjU7ly1gdb5673as5j307i0ait97.jpg'
            // },
            // {
            //     id: 33,
            //     title: '圣诞老人公司',
            //     latestChapter: 'BD720P',
            //     imgSrc: 'https://wxt.sinaimg.cn/large/006MDjU7ly1gd8z2c6o1yj307i0alq3s.jpg'
            // },
            // {
            //     id: 34,
            //     title: '心理测量者3：第一监视者',
            //     latestChapter: 'BD720P',
            //     imgSrc: 'https://wxt.sinaimg.cn/large/006MDjU7ly1gd9jon7tmjj307i0al0t8.jpg'
            // },
            // {
            //     id: 35,
            //     title: '我们的七日战争',
            //     latestChapter: 'BD720P',
            //     imgSrc: 'https://wxt.sinaimg.cn/large/006MDjU7ly1gd61oyks6tj307i0ajaad.jpg'
            // },
            // {
            //     id: 36,
            //     title: '为美好的世界献上祝福！红传说',
            //     latestChapter: 'BD720P',
            //     imgSrc: 'https://wxt.sinaimg.cn/large/006MDjU7ly1g9jvjwh5ooj307i0alq3l.jpg'
            // }
        ],
        commentList: [
            {
                id: 1,
                avatarSrc: 'https://ss0.bdstatic.com/70cFuHSh_Q1YnxGkpoWK1HF6hhy/it/u=3832099094,1425661950&fm=26&gp=0.jpg',
                userName: 'Dragon.mr',
                subtime: '2020-04-22 15:30:05'
            },
            {
                id: 2,
                avatarSrc: 'https://ss0.bdstatic.com/70cFuHSh_Q1YnxGkpoWK1HF6hhy/it/u=3832099094,1425661950&fm=26&gp=0.jpg',
                userName: 'Dragon.mr',
                subtime: '2020-04-22 15:30:05'
            },
            {
                id: 3,
                avatarSrc: 'https://ss0.bdstatic.com/70cFuHSh_Q1YnxGkpoWK1HF6hhy/it/u=3832099094,1425661950&fm=26&gp=0.jpg',
                userName: 'Dragon.mr',
                subtime: '2020-04-22 15:30:05'
            },
            {
                id: 4,
                avatarSrc: 'https://ss0.bdstatic.com/70cFuHSh_Q1YnxGkpoWK1HF6hhy/it/u=3832099094,1425661950&fm=26&gp=0.jpg',
                userName: 'Dragon.mr',
                subtime: '2020-04-22 15:30:05'
            },
            {
                id: 5,
                avatarSrc: 'https://ss0.bdstatic.com/70cFuHSh_Q1YnxGkpoWK1HF6hhy/it/u=3832099094,1425661950&fm=26&gp=0.jpg',
                userName: 'Dragon.mr',
                subtime: '2020-04-22 15:30:05'
            },
            {
                id: 6,
                avatarSrc: 'https://ss0.bdstatic.com/70cFuHSh_Q1YnxGkpoWK1HF6hhy/it/u=3832099094,1425661950&fm=26&gp=0.jpg',
                userName: 'Dragon.mr',
                subtime: '2020-04-22 15:30:05'
            },
            {
                id: 7,
                avatarSrc: 'https://ss0.bdstatic.com/70cFuHSh_Q1YnxGkpoWK1HF6hhy/it/u=3832099094,1425661950&fm=26&gp=0.jpg',
                userName: 'Dragon.mr',
                subtime: '2020-04-22 15:30:05'
            },
            {
                id: 8,
                avatarSrc: 'https://ss0.bdstatic.com/70cFuHSh_Q1YnxGkpoWK1HF6hhy/it/u=3832099094,1425661950&fm=26&gp=0.jpg',
                userName: 'Dragon.mr',
                subtime: '2020-04-22 15:30:05'
            },
            {
                id: 9,
                avatarSrc: 'https://ss0.bdstatic.com/70cFuHSh_Q1YnxGkpoWK1HF6hhy/it/u=3832099094,1425661950&fm=26&gp=0.jpg',
                userName: 'Dragon.mr',
                subtime: '2020-04-22 15:30:05'
            },
            {
                id: 10,
                avatarSrc: 'https://ss0.bdstatic.com/70cFuHSh_Q1YnxGkpoWK1HF6hhy/it/u=3832099094,1425661950&fm=26&gp=0.jpg',
                userName: 'Dragon.mr',
                subtime: '2020-04-22 15:30:05'
            },
            {
                id: 11,
                avatarSrc: 'https://ss0.bdstatic.com/70cFuHSh_Q1YnxGkpoWK1HF6hhy/it/u=3832099094,1425661950&fm=26&gp=0.jpg',
                userName: 'Dragon.mr',
                subtime: '2020-04-22 15:30:05'
            },
            {
                id: 12,
                avatarSrc: 'https://ss0.bdstatic.com/70cFuHSh_Q1YnxGkpoWK1HF6hhy/it/u=3832099094,1425661950&fm=26&gp=0.jpg',
                userName: 'Dragon.mr',
                subtime: '2020-04-22 15:30:05'
            },
            {
                id: 13,
                avatarSrc: 'https://ss0.bdstatic.com/70cFuHSh_Q1YnxGkpoWK1HF6hhy/it/u=3832099094,1425661950&fm=26&gp=0.jpg',
                userName: 'Dragon.mr',
                subtime: '2020-04-22 15:30:05'
            }
        ],

        episodeList:[],
        
        searchParams:{},

        conmonList:[]
    },
    getters: {
        navList: state => state.navList,
        hotPlayList: state => state.hotPlayList,
        fanTimeTable: state => state.fanTimeTable,
        rimanList: state => state.rimanList,
        guomanList: state => state.guomanList,
        bangumiList: state => state.bangumiList,
        theaterList: state => state.theaterList,
        filmtvList: state => state.filmtvList,
        serhResultList: state => state.serhResultList,
        commentList: state => state.commentList,
        episodeList:state => state.episodeList,
        objectInfo:state => state.objectInfo,
        videoParams:state => state.videoParams,
        searchParams:state => state.searchParams,
        conmonList:state => state.conmonList,
    },
    mutations: {  //大写
        UpdateEpisodeList(state, episodeList) {
            state.episodeList = episodeList;
        },
        UpdateObjectInfo(state, objectInfo) {
            state.objectInfo = objectInfo;
        },
        UpdateVideoParams(state, videoParams) {
            sessionStorage.setItem('videoParams',JSON.stringify(videoParams));
            state.videoParams = videoParams;
        },
        UpdateBangumiList(state,bangumiList){
            state.bangumiList = bangumiList;
        },
        UpdateGuomanList(state,guomanList){
            state.guomanList = guomanList;
        },
        UpdateTheaterList(state,theaterList){
            state.theaterList = theaterList;
        },
        UpdateFilmtvList(state,filmtvList){
            state.filmtvList = filmtvList;
        },
        UpdateSearchParams(state,params){
            state.searchParams[params.key] = params.value;
        },
        UpdateConmonList(state,conmonList){
            state.conmonList = conmonList;
        },
    },
    actions: {   //小写

    }
})